nr_uci.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-28 Sat 01:49 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NR - Uplink Control Information (UCI)</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">NR - Uplink Control Information (UCI)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge43f264">Introduction</a></li>
<li><a href="#org51294d2">UCI formats</a>
<ul>
<li><a href="#orgdd1eb18">Format 0</a></li>
<li><a href="#org7d9d340">Format 1</a></li>
<li><a href="#org9fd68a9">Format 2</a></li>
<li><a href="#org0b7bb1e">Format 3</a></li>
<li><a href="#orgb09451c">Format 4</a></li>
</ul>
</li>
<li><a href="#org933f101">UCI on PUCCH</a></li>
<li><a href="#orge38f42e">UCI on PUSCH</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge43f264" class="outline-2">
<h2 id="orge43f264">Introduction</h2>
<div class="outline-text-2" id="text-orge43f264">
<p>
Targetting for HARQ acknowledgement and scheduling request, similar to LTE, <i>uplink control information (UCI)</i> is transmitted on <i>physical uplink control channel (PUCCH)</i> or <i>physical uplink shared channel (PUSCH)</i>.
</p>

<p>
Simultaneous transmission of PUCCH and PUSCH is not supported in release 15, but UCI can be pigged-back on PUSCH, i.e., UCI is multiplexed with data and transmitted on PUSCH.
</p>

<p>
In <i>carrier aggregation (CA)</i> case, UCI is only transmitted on the primary cell (PCell), to support asymmetric CA, i.e., different number of carriers in the downlink and uplink. To avoid overloading, PUCCH's can be divided into 2 groups. The feedback relating to the 1st group is transmitted in the uplink of the PCell, while the feedback corresponding to the 2nd group is delivered in the uplink of the primary second cell (PSCell).
</p>

<p>
For PUCCH, only a single antenna port is specified. Given a UE equipped with multiple antennas, how to make use of the antenna array is a UE implementation related issue.
</p>
</div>
</div>
<div id="outline-container-org51294d2" class="outline-2">
<h2 id="org51294d2">UCI formats</h2>
<div class="outline-text-2" id="text-org51294d2">
<p>
There are 5 PUCCH formats, termed formats 0, 1, 2, 3, and 4, respectively.
</p>

<dl class="org-dl">
<dt>Short PUCCH formats</dt><dd>Formats 0 and 2 are referred to as short PUCCH formats since it occupies \(\le 2\) OFDM symbols in the time domain. Typically, they are transmitted at the end of a slot, but it is still possible to be transmitted in other positions within a slot. Format 0 can carry \(\le 2\) bits, and format 2 can convey \(\ge 2\) bits.</dd>
<dt>Long PUCCH formats</dt><dd>Formats 1, 3, 4 are termed long PUCCH formats due to its duration of 4-14 OFDM symbols. Formats 1 and 3 are the long PUCCH counterparts of formats 0 and 2, which can carry \(\le 2\) bits and \(\ge 2\) bits, respectively.</dd>
</dl>
</div>
<div id="outline-container-orgdd1eb18" class="outline-3">
<h3 id="orgdd1eb18">Format 0</h3>
<div class="outline-text-3" id="text-orgdd1eb18">
<p>
Format 0 can carry a HARQ acknowledgement or a scheduling request.
</p>

<p>
Different payload value corresponds with different cyclic shifts (CS) on top of a base sequence which is per-cell configured. For HARQ acknowledgements, the CS differences are \(\pi\) and \(\pi/2\) for 1 and 2 bits payload, respectively. What is worth noting, the aforementioned CS is based on a <i>reference</i>, which is provided as part of the PUCCH resource allocation mechanism.
</p>

<p>
Additionally, slot-wise CS hopping and sequence hopping can be configured.
</p>

<p>
If 2 OFDM symbols are occupied by PUCCH format 0, the same information is transmitted in the both symbols.
</p>
</div>
</div>
<div id="outline-container-org7d9d340" class="outline-3">
<h3 id="org7d9d340">Format 1</h3>
<div class="outline-text-3" id="text-org7d9d340">
<p>
Sequence hopping and CS hopping can be configured to randomize interference.
</p>
</div>
</div>
<div id="outline-container-org9fd68a9" class="outline-3">
<h3 id="org9fd68a9">Format 2</h3>
<div class="outline-text-3" id="text-org9fd68a9">
<p>
Format 2 can support simultaneous CSI reporting and HARQ acknowledgements, or a large number of HARQ acknowledgements. Additionally, a scheduling request can also be included by joint encoding. If the payload is too large, the CSI report will be dropped.
</p>

<p>
The basic procedure can be listed as follows.
</p>
<ol class="org-ol">
<li>For larger payload size, a CRC is attached.</li>
<li>Channel coding: Reed-Muller codes for payload size \(\le 11\) bits, and polar codes for payload size \(> 11\) bits.</li>
<li>Cell radio network temporary identifier (C-RNTI) and physical cell identity (PCID) based scrambling</li>
<li>QPSK modulation</li>
</ol>

<p>
For better performance, coherent detection is used with DMRS mapped to every 3rd subcarrier in each OFDM symbol.
</p>
</div>
</div>
<div id="outline-container-org0b7bb1e" class="outline-3">
<h3 id="org0b7bb1e">Format 3</h3>
<div class="outline-text-3" id="text-org0b7bb1e">
<p>
Similar to format 2, the basic procedure can be listed as below.
</p>
<ol class="org-ol">
<li>For larger payload size, a CRC is attached.</li>
<li>Channel coding: Reed-Muller codes for payload size \(\le 11\) bits, and polar codes for payload size \(> 11\) bits.</li>
<li>C-RNTI and PCID based scrambling</li>
<li>QPSK or \(\pi/2\) -BPSK modulation</li>
</ol>

<p>
Targetting for frequency diversity, frequency hopping can be configured.
</p>

<p>
In the mapping of UCI, the more critical bits, i.e., HARQ acknowledgements, scheduling request, and CSI part 1 are jointly coded and mapped close to the DMRS RE's, while the less critical bits are mapped to the remaining positions.
</p>
</div>
</div>
<div id="outline-container-orgb09451c" class="outline-3">
<h3 id="orgb09451c">Format 4</h3>
<div class="outline-text-3" id="text-orgb09451c">
<p>
Essentially, format 4 is the same as format 3, but it enables the multiplexing of users in the same resource.
</p>
</div>
</div>
</div>
<div id="outline-container-org933f101" class="outline-2">
<h2 id="org933f101">UCI on PUCCH</h2>
<div class="outline-text-2" id="text-org933f101">
<p>
In NR, the concept of <i>PUCCH resource set</i> has been proposed.
</p>
<ul class="org-ul">
<li>A PUCCH resource set is comprised of \(\ge 4\) <i>PUCCH resource configurations</i>, and each resource configuration indicates the PUCCH format and all the corresponding parameters.</li>
<li>At most 4 PUCCH resource sets can be configured.
<ul class="org-ul">
<li>PUCCH resource set 0 corresponds with UCI payload size \(\le 2\) bits and therefore only contains PUCCH formats 0 and 1.</li>
<li>Remaining PUCCH resource sets may contain any PUCCH formats except formats 0 and 1.</li>
</ul></li>
<li>Given a UCI, its payload size determines the PUCCH resource set and the PUCCH resource indicator (PRI) in the DCI determines the PUCCH resource configuration within the PUCCH resource set.</li>
</ul>
</div>
</div>
<div id="outline-container-orge38f42e" class="outline-2">
<h2 id="orge38f42e">UCI on PUSCH</h2>
<div class="outline-text-2" id="text-orge38f42e">
<ul class="org-ul">
<li>In NR, irrespective of CP-OFDM or DFT-S-OFDM based uplink, UCI on PUSCH is supported for simultaneous transmission of UCI and UL-SCH.</li>
<li>Only HARQ acknowledgements and CSI reports can be transmitted over PUSCH, since there is no need to request a new scheduling grant for a user with a scheduling grant already.</li>
</ul>
</div>
</div>
</div>
</body>
</html>